//    #              #                                              #                #
//    #              #                                              #                #
//    #              #                                              #                #
//    #              #                     #  #                     #                #
//    #              #                  #        #                  #                #                     #  #  #
//    #              #               #              #               #                #                  #           #
//    #  #  #  #  #  #            #                    #            #                #               #                  #
//    #              #            #                    #            #                #               #                  #
//    #              #            #  #  #  #  #  #  #  #            #                #               #                  #
//    #              #            #                                 #                #               #                  #
//    #              #            #                                 #                #               #                  #
//    #              #               #                              #                #                  #            #
//    #              #                  #  #  #                     #  #             #  #                  #  #  #
//
//    三((((｀ω´ﾉ；)ﾉ

console.log("開発者ツールを見たあなた!\nクイズをやってみませんか?");
console.log("あなたのお好みの言語で次のようなコードを書いてください");
console.log("文字列のリストを引数 xs に与えると、リスト中に含まれる最も長い文字列の長さを戻り値として返す関数を定義します。\nなお、xs には一つ以上の文字列が含まれることを前提とします。");
console.log("動作例(Pythonを使用)\n>>> max_len(['I', 'have', 'a', 'pen'])\n4\n>>> max_len(['I', 'have', 'an', 'apple'])\n5")
console.log("模範解答と解説を見るには、このコンソール上で showAns関数を実行してください。")

function showAnswer(){
    location.href = "./wonderful.html";
}

function showAns(){
    console.log("すみません！(ﾟдﾟ;)汗\nshowAnswerでした、、、")
}
